app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2017-04-03 13:20:54.313558"], ["text", "sadnfasknfaf"], ["title", "Article 1"], ["updated_at", "2017-04-03 13:20:54.313558"]]
---
def create
  @article = Article.new(article_params)

  @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 3  [["text", "some mo' text"], ["title", "Article 3"], ["updated_at", "2017-04-03 13:55:10.066558"]]
---
def update
  @article = Article.find(params[:id])

  if @article.update(article_params)